/*
***********************************************************************************************************************************************
*
*		模块名称 ： 流水灯模块
*		文件名称 ： 看门狗应用.c
*		版本		 ： v1.0
*		说明		 ： 设定看门狗时间为2s,然后点亮第一个发光二极管，稍延时一会，然后熄灭二极管，使程序进入死循环，
*								并且在死循环中间隔1s喂狗一次，使单片机不复位，保持二极管熄灭的状态
*								
*		修改记录 ：
*			  版本号		日期				作者			说明
*				v1.0		2020-01-31	Yang			v1.0版本进行测试
*				
*
***********************************************************************************************************************************************
*/

#include <reg52.h>
#define uchar unsigned char
#define uint unsigned int
	
sfr WCD_CONTR=0xe1;//声明看门狗控制寄存器
sbit led=P1^0;

/****延时函数，延时n毫秒****/
void delay_ms(uint n)
{
	uint i,j;
	for(i=n;i>0;i--)
		for(j=110;j>0;j--);
}

/****主函数****/
void main()
{
	WCD_CONTR=0x35;//开启看门狗，64分频，约2s溢出时间
	led=0;
	delay_ms(500);
	led=1;
	while(1)
	{
		delay_ms(1000);//延时时间最多为1597ms，否则超过看门狗溢出时间，会复位单片机
		WCD_CONTR=0x35;//喂狗
	}
}
